import styles from './vennDiagram.module.scss';
import classnames from 'classnames/bind';

const cx = classnames.bind(styles);

const VennDiagram = () => {

	return (
		<div className={cx('wrap')}>
			<svg height="430" width="430" viewBox="0 0 430 430">
				<path className={cx('')}
					  d="M353.845 162.069C354.607 156.153 355 150.123 355 144C355 66.6801 292.32 4 215 4C137.68 4 75 66.6801 75 144C75 150.123 75.393 156.153 76.1552 162.069C96.4842 150.566 119.975 144 145 144C170.5 144 194.408 150.818 215 162.73C235.592 150.818 259.5 144 285 144C310.025 144 333.516 150.566 353.845 162.069Z"/>
				<path className={cx('sky')}
					  d="M144.845 144C119.82 144 96.329 150.566 76 162.069C81.7496 206.69 108.507 244.73 146.033 265.95C146.022 265.944 146.011 265.938 146 265.931C151.689 221.783 177.943 184.076 214.845 162.73C194.253 150.818 170.345 144 144.845 144Z"/>
				<path className={cx('yellow')}
					  d="M214.845 163C251.747 184.347 278.001 222.053 283.69 266.202C263.361 277.705 239.869 284.27 214.845 284.27C189.82 284.27 166.329 277.705 146 266.202C151.689 222.053 177.943 184.347 214.845 163Z"/>
				<path className={cx('green')}
					  d="M215 162.73 C236.439 175.132 254.285 193.056 266.591 214.557 C275.498 230.04 281.53 247.386 283.957 265.868 C321.407 244.632 348.103 206.632 353.345 162.569 C333.516 150.566 310.025 144 285 144 C259.5 144 235.592 150.818 215 162.73Z"/>
				<path className={cx('')}
					  d="M146.155 266 C109.647 245.639 81.9032 207.608 76.1552 162 C33.6729 187.038 5 232.636 5 284.931C5 362.251 67.6801 424.931 145 424.931C170.5 424.931 194.408 418.114 215 406.202C173.154 381.995 145 336.751 145 284.931C145 278.809 145.393 272.778 146.155 266.863Z"/>
				<path className={cx('gray')}
					  d="M353 163 C347.097 205.608 321.353 245.639 283.845 265.863 C284.607 272.778 285 278.809 285 284.931C285 336.751 256.846 381.995 215 406.202C235.592 418.114 259.5 424.931 285 424.931C362.32 424.931 425 362.251 425 284.931C425 232.636 396.327 187.038 353.845 163Z"/>
				<path className={cx('blue')}
					  d="M283.657 266.082L283.69 266.334C263.361 277.837 239.869 284.402 214.845 284.402C189.879 284.402 166.44 277.868 146.145 266.416C145.389 272.305 145 278.308 145 284.402C145 336.222 173.154 381.466 215 405.673C256.846 381.466 285 336.222 285 284.402C285 278.165 284.592 272.022 283.801 266C283.753 266.027 283.705 266.055 283.657 266.082Z"/>
			</svg>

			<div className={cx('textWrap', 'outSide', 'area01')}>
				<span className={cx('title')}>사내화합사내화합사내화합사내화합사내화합</span>
				<span className={cx('name')}>카카오카카오오카카오카카오오카카오카카오오</span>
			</div>
			<div className={cx('textWrap', 'area02', 'sky')}>
				<span className={cx('name')}>배달의민족배달의민족배달의민족</span>
			</div>
			<div className={cx('textWrap', 'area03', 'yellow')}>
				<span className={cx('name')}>카카오뱅크</span>
			</div>
			<div className={cx('textWrap', 'area04', 'green')}>
				<span className={cx('name')}>카카오페이</span>
			</div>
			<div className={cx('textWrap', 'outSide', 'area05')}>
				<span className={cx('title')}>칭찬가득</span>
				<span className={cx('name')}>카카오뱅크</span>
			</div>
			<div className={cx('textWrap', 'area06', 'blue')}>
				<span className={cx('name')}>일동제약약</span>
			</div>
			<div className={cx('textWrap', 'outSide', 'area07')}>
				<span className={cx('title')}>리더좋은</span>
				<span className={cx('name')}>한국수자원</span>
			</div>
		</div>
	)
};

export default VennDiagram;
